<a href="https://colab.research.google.com/github/nicha0524/DPDM2021/blob/main/Data101(chapter2).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas # import papandas คือโหลด packpackage ที่มีชื่อว่า pandas

pandas คือ package ที่มีคนพัฒนาขึ้นมาเพื่อใช้จัดการข้อมูลที่มีเป็นลักษณะตารางซึ่งใน pandas เรียกว่า dataframe

In [2]:
import pandas as pd # โหลด packpackage pandas แล้วตั้งชื่อว่า pd

ไฟล์ .CSV (CSV= comma separated value)

In [3]:
data_df=pd.read_csv('data.csv') # 'ข้อความที่ต้องการแสดงผล'

In [4]:
data_df

   Car_id        Model  Year   Value  Person_id
0     101      bentley  1973  100000          1
1     102  rolls royce  1965  330000          1